# RenderingImageExposureSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RenderingImageExposureSettings Members
RenderingImageExposureSettings Class Methods Properties See Also
---
The RenderingImageExposureSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RenderingImageExposureSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExposureValue | The value of rendering image exposure. |
| Highlights | The highlights value. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Saturation | The value of rendering image saturation. |
| Shadows | The shadows value. |
| WhitePoint | The white point value. |

# See Also
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace